app/views/topics/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---
    submitted <%= time_ago_in_words(post.created_at)%> ago by <%= post.user.name %> <br/>
    <%= post.comments.count %> Comments