app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
        <small>
          <%= pluralize(@user.posts.count, 'post') %>,
          <%= pluralize @user.comments.count, 'comment' %>