app/views/posts/_post.html.erb

             <%= post.user.name %> </br>
             <%= post.comments.count %> Coments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 51]]