app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "ja"], ["user_id", 6], ["post_id", 118], ["created_at", "2015-01-16 12:26:41.543392"], ["updated_at", "2015-01-16 12:26:41.543392"]]
---
  def create

    @post = Post.find(params[:post_id])
    @comment = current_user.comments.build(params.require(:comment).permit(:body))
    #hiermee pak je dus posts/150 in http://localhost:3000/posts/150
    #hiermee voeg je hem toe aan de comments in post.
    @post.comments << @comment

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 118]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 9], ["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."topic_id" = ? AND "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["topic_id", 2], ["id", 9]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy

    @post  = Post.find(params[:post_id])
    @topic = @post.topic
    @comment = @post.comments.find(params[:id])

    authorize @comment
    if @comment.destroy