app/controllers/favorites_controller.rb

  def create
    @post = Post.find(params[:post_id])
    favorite = current_user.favorites.build(post: @post)
    authorize favorite

    if favorite.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 51]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 51], ["user_id", 6], ["created_at", "2015-01-18 16:05:46.248722"], ["updated_at", "2015-01-18 16:05:46.248722"]]