app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 12]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find(params[:id])
    @topic = Topic.find(params[:topic_id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 12]]
---
  def new
    @topic = Topic.find(params[:topic_id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 12]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Een post"], ["body", "Geschreven door Marc!"], ["user_id", 1], ["created_at", "2015-01-15 16:10:42.265975"], ["updated_at", "2015-01-15 16:10:42.265975"]]
---
  def create
    #What values are permitted and required?
    @topic = Topic.find(params[:topic_id])
    @post = current_user.posts.build(params.require(:post).permit(:title, :body))

    @topic.posts << @post

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 7]]
---
  def edit
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 7]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Deze post bevate zeker 25 woorden, weet je wel\r\n"], ["updated_at", "2015-01-18 13:50:22.844648"], ["id", 147]]
---
  def update
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])
    authorize @post
    #nog aanpassen aan de hand van 29.

    if @post.update_attributes(params.require(:post).permit(:title, :body, ))

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 10]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
---
  def destroy
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])
    title = @post.title



    if @post.destroy