app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "topics"
---
  def index
    # @topics = Topic.all
    @topics = Topic.visible_to(current_user).paginate(page: params[:page], per_page: 10)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["topic_id", 2]]
---
  def show
    @topic = Topic.find(params[:id])
    # @posts = @topic.posts
    @posts = @topic.posts.paginate(page: params[:page], per_page: 10)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Topic 2"], ["description", "Dit is zojuist gemaakt"], ["created_at", "2015-01-16 09:23:25.668997"], ["updated_at", "2015-01-16 09:23:25.668997"]]
---
  def create
    @topic = Topic.new(params.require(:topic).permit(:name, :description, :public))
    authorize @topic
    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "Dit is een ander topic"], ["updated_at", "2015-01-16 10:09:09.629769"], ["id", 1]]
---
  def update
    @topic = Topic.find(params[:id])
    authorize @topic
    if @topic.update_attributes(params.require(:topic).permit(:name, :description, :public))

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic = Topic.find(params[:id])
    name = @topic.name

    authorize @topic

    #this will return true of false
    if @topic.destroy