app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 10]]
---
  def show
    # @topic = Topic.find(params[:id])
    @user = User.find(params[:id])